docs/SOLID.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-17 sex 15:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SOLID</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bruno Coimbra (b-coimbra)" />
<link rel="stylesheet" type="text/css" href="https://b-coimbra.github.io/org-scribbler-theme/src/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">SOLID
<br />
<span class="subtitle">In software engineering, SOLID is a mnemonic acronym for five design principles intended to make software designs more understandable, flexible, and maintainable.</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd705ca5">SRP (Single Reponsibility Principle)</a></li>
<li><a href="#org77c0feb">OCP (Open Closed Principle)</a></li>
<li><a href="#orgbde07ea">LSP (Liskov Substitution Principle)</a></li>
<li><a href="#orgb8b11c0">ISP (Interface Segregation Principle)</a></li>
<li><a href="#orgd92a529">DIP (Dependency Inversion Principle)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd705ca5" class="outline-2">
<h2 id="orgd705ca5">SRP (Single Reponsibility Principle)</h2>
<div class="outline-text-2" id="text-orgd705ca5">
<p>
<i>A module should only have one, and only one reason to change.</i>
</p>

<p>
Not to be mistaken by the principle usually applied to functions: <i>A function should only do one thing, and one thing only.</i>
</p>

<p>
A class should not handle operations that goes out of the objective of the class.
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #cc6666; font-weight: bold;">class</span> <span style="color: #d3869b;">AreaCalculator</span> {
    <span style="color: #cc6666; font-weight: bold;">constructor</span> (shapes: <span style="color: #cc6666; font-weight: bold;">number</span>[]) {
        <span style="color: #cc6666; font-weight: bold;">this</span>.shapes = shapes;
    }

    <span style="color: #777777;">sum</span> (): <span style="color: #cc6666; font-weight: bold;">number</span> {
        <span style="color: #7c6f64;">// </span><span style="color: #7c6f64;">logic to sum the area</span>
    }
}
</pre>
</div>

<p>
We'd simply instantiate the class and pass an array of shapes, then display the output:
</p>

<div class="org-src-container">
<pre class="src src-typescript">areas = AreaCalculator.<span style="color: #cc6666; font-weight: bold;">new</span>([2, 5, 6])

<span style="color: #d3869b;">console</span>.<span style="color: #777777;">log</span>(areas.<span style="color: #777777;">sum</span>());
</pre>
</div>

<p>
But what if we wanted to return the result as JSON, or another format?
</p>

<p>
<b>SRP frowns upon letting the Area class handle this logic. The Area class should only sum the areas, it should not care whether the user wants JSON or HTML.</b>
</p>

<p>
Instead, we create a new class, <b>AreaCalculatorOutputter</b> to handle the conversion:
</p>

<div class="org-src-container">
<pre class="src src-typescript">areas  = AreaCalculator.<span style="color: #cc6666; font-weight: bold;">new</span>([2, 5, 6])
output = <span style="color: #777777;">SumCalculatorOutputter</span>(areas);

<span style="color: #d3869b;">console</span>.<span style="color: #777777;">log</span>(output.<span style="color: #777777;">json</span>());
<span style="color: #d3869b;">console</span>.<span style="color: #777777;">log</span>(output.<span style="color: #777777;">html</span>());
<span style="color: #d3869b;">console</span>.<span style="color: #777777;">log</span>(output.<span style="color: #777777;">haml</span>());
</pre>
</div>

<p>
When this principle is broken, the following issues arise:
</p>

<ul class="org-ul">
<li>Class loses its cohesion: it has more than one responsibility.</li>
<li>High coupling: due to the many entangled dependencies, the class will depend on a lot of low-level modules.</li>
</ul>
</div>
</div>

<div id="outline-container-org77c0feb" class="outline-2">
<h2 id="org77c0feb">OCP (Open Closed Principle)</h2>
<div class="outline-text-2" id="text-org77c0feb">
<p>
<i>A module should be open to extension, but closed for modification.</i>
</p>

<p>
Open to extension means that a class should be easy to add new functionality without changing already existing code (and breaking it).
</p>

<p>
A class should be easily extensible without modifying the class itself.
</p>

<p>
Looking at the AreaCalculator class, the <b>sum</b> method:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #777777;">sum</span> (): <span style="color: #cc6666; font-weight: bold;">number</span> {
    <span style="color: #cc6666; font-weight: bold;">let</span> <span style="color: #83a598;">area</span>: <span style="color: #cc6666; font-weight: bold;">number</span>;

    <span style="color: #cc6666; font-weight: bold;">for</span> (<span style="color: #cc6666; font-weight: bold;">let</span> <span style="color: #83a598;">shape</span> <span style="color: #cc6666; font-weight: bold;">of</span> shapes) {
        <span style="color: #cc6666; font-weight: bold;">if</span> (shape == <span style="color: #476562;">'Square'</span>)
            area = <span style="color: #777777;">pow</span>(shape.length, 2);
        <span style="color: #cc6666; font-weight: bold;">else</span> <span style="color: #cc6666; font-weight: bold;">if</span> (shape == <span style="color: #476562;">'Circle'</span>)
            area = Math.PI * <span style="color: #777777;">pow</span>(Math.<span style="color: #777777;">radius</span>(shape), 2);
    }

    <span style="color: #cc6666; font-weight: bold;">return</span> Math.<span style="color: #777777;">sum</span>(shape);
}
</pre>
</div>

<p>
If we wanted the sum to be able to handle more shapes, we would add more <b>if/else</b> blocks, and that goes against the Open-closed Principle.
</p>

<p>
One way to handle this is to remove the logic of the sum in the AreaCalculator class and assign it to each shape class:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #cc6666; font-weight: bold;">class</span> <span style="color: #d3869b;">Square</span> {
    <span style="color: #cc6666; font-weight: bold;">constructor</span> (length: <span style="color: #cc6666; font-weight: bold;">number</span>) {
        <span style="color: #cc6666; font-weight: bold;">this</span>.length = length;
    }

    <span style="color: #777777;">area</span> (): <span style="color: #cc6666; font-weight: bold;">number</span> {
        <span style="color: #cc6666; font-weight: bold;">return</span> <span style="color: #777777;">pow</span>(<span style="color: #cc6666; font-weight: bold;">this</span>.length, 2);
    }
}
</pre>
</div>

<p>
The same thing should be done for the Circle, or any other shape class.
</p>

<p>
<b>A problem arises: how do we know that the object passed into the AreaCalculator is actually a shape and it has a method named area?</b>
</p>

<p>
We create <b>interfaces</b> for it, that every shape implements:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #cc6666; font-weight: bold;">interface</span> <span style="color: #d3869b;">ShapeInterface</span> {
    <span style="color: #777777;">area</span> (): <span style="color: #cc6666; font-weight: bold;">void</span>;
}

<span style="color: #cc6666; font-weight: bold;">class</span> <span style="color: #d3869b;">Circle</span> <span style="color: #cc6666; font-weight: bold;">implements</span> <span style="color: #d3869b;">ShapeInterface</span> {
    <span style="color: #7c6f64;">// </span><span style="color: #7c6f64;">...</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbde07ea" class="outline-2">
<h2 id="orgbde07ea">LSP (Liskov Substitution Principle)</h2>
<div class="outline-text-2" id="text-orgbde07ea">
<p>
<i>A superclass module should be replaceable by its subclass modules</i>
</p>

<p>
In other words, every derived class can be used as if it were the base class.
</p>
</div>
</div>

<div id="outline-container-orgb8b11c0" class="outline-2">
<h2 id="orgb8b11c0">ISP (Interface Segregation Principle)</h2>
<div class="outline-text-2" id="text-orgb8b11c0">
<p>
<i>A client should never be forced to implement an interface that it doesn't use or clients shouldn't be forced to depend on methods they do not use</i>
</p>

<p>
If we wanted to calculate the volume of the shape, we'd simply modify the ShapeInterface:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #cc6666; font-weight: bold;">interface</span> <span style="color: #d3869b;">ShapeInterface</span> {
    <span style="color: #777777;">area</span>(): <span style="color: #cc6666; font-weight: bold;">number</span>;
    <span style="color: #777777;">volume</span>(): <span style="color: #cc6666; font-weight: bold;">number</span>;
}
</pre>
</div>

<p>
Now any shape must implement the volume method.
</p>

<p>
However, we know that squares are flat and do not have volumes, so we are forcing the <b>Square</b> class to implement a method that it has no use of.
</p>

<p>
ISP says no to this, instead we could create another interface called SolidShapeInterface that has the volume contract, and solid shapes like cubes etc. can implement this interface:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #cc6666; font-weight: bold;">interface</span> <span style="color: #d3869b;">ShapeInterface</span> {
    <span style="color: #777777;">area</span>(): <span style="color: #cc6666; font-weight: bold;">number</span>;
}

<span style="color: #cc6666; font-weight: bold;">interface</span> <span style="color: #d3869b;">SolidShapeInterface</span> {
    <span style="color: #777777;">volume</span>(): <span style="color: #cc6666; font-weight: bold;">number</span>;
}

<span style="color: #cc6666; font-weight: bold;">class</span> <span style="color: #d3869b;">Cuboid</span> <span style="color: #cc6666; font-weight: bold;">implements</span> <span style="color: #d3869b;">ShapeInterface</span>, <span style="color: #d3869b;">SolidShapeInterface</span> {
    <span style="color: #777777;">area</span> (): <span style="color: #cc6666; font-weight: bold;">number</span> {
        <span style="color: #7c6f64;">// </span><span style="color: #7c6f64;">calculate the area of the cuboid</span>
    }

    <span style="color: #777777;">volume</span> (): <span style="color: #cc6666; font-weight: bold;">number</span> {
        <span style="color: #7c6f64;">// </span><span style="color: #7c6f64;">calculate the volume of the cuboid</span>
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd92a529" class="outline-2">
<h2 id="orgd92a529">DIP (Dependency Inversion Principle)</h2>
<div class="outline-text-2" id="text-orgd92a529">
<p>
<i>Entities must depend on abstractions not on concretions. It states that the high level module must not depend on the low level module, but they should depend on abstractions.</i>
</p>

<p>
Assuming we have a class <b>PasswordReminder</b> that connects to the database:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #cc6666; font-weight: bold;">class</span> <span style="color: #d3869b;">PasswordReminder</span> {
    <span style="color: #cc6666; font-weight: bold;">constructor</span> (dbConnection: <span style="color: #d3869b;">MySQLConnection</span>) {
        <span style="color: #cc6666; font-weight: bold;">this</span>.dbConnection = dbConnection;
    }
}
</pre>
</div>

<p>
The <b>MySQLConnection</b> is the low level module while the <b>PasswordReminder</b> class is high level, this violates the dependency principle because the <b>PasswordReminder</b> class is being forced to depend on the <b>MySQLConnection</b> class.
</p>

<p>
If we were to change the database engine, we'd have to edit the <b>PasswordReminder</b> class, thus violating the OCP.
</p>

<p>
The <b>PasswordReminder</b> class should not care what database my application uses.
To fix this, we create yet another interface.
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #cc6666; font-weight: bold;">interface</span> <span style="color: #d3869b;">DBConnectionInterface</span> {
    <span style="color: #777777;">connect</span> (): <span style="color: #cc6666; font-weight: bold;">void</span>;
}
</pre>
</div>

<p>
The interface has a connect method and the <b>MySQLConnection</b> implements this interface.
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #cc6666; font-weight: bold;">class</span> <span style="color: #d3869b;">MySQLConnection</span> <span style="color: #cc6666; font-weight: bold;">implements</span> <span style="color: #d3869b;">DBConnectionInterface</span> {
    <span style="color: #777777;">connect</span> (): <span style="color: #cc6666; font-weight: bold;">void</span> {
        <span style="color: #7c6f64;">// </span><span style="color: #7c6f64;">connects to a database</span>
    }
}

<span style="color: #cc6666; font-weight: bold;">class</span> <span style="color: #d3869b;">PasswordReminder</span> {
    <span style="color: #cc6666; font-weight: bold;">constructor</span> (dbConnection: <span style="color: #d3869b;">DBConnectionInterface</span>) {
        <span style="color: #cc6666; font-weight: bold;">this</span>.dbConnection = dbConnection;
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-09-13 seg 00:00</p>
<p class="author">Author: Bruno Coimbra (b-coimbra)</p>
<p class="date">Created: 2021-09-17 sex 15:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
